<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"27c6026f07d971e2033a7c75f159dfc7c89f0f15bd54cd77c9c279cc583a746c","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #715 at https://github.com/cal-itp/data-infra/actions/runs/18025057657","plan_out_hash":"dfdc34821949c35e7bae148f5c780efb64683bc9cf432e636ef4505751273d6e","plan_hash":"e9108d216a10f6b0fcde5b43c72c70df40ede05273005f80593fc163ad216ba5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/sync_kuba/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "s/KVPg==" -> (known after apply)
!~      detect_md5hash      = "rYX57iU0NadWmDL/eY1oCg==" -> "different hash"
!~      generation          = 1753225938231786 -> (known after apply)
        id                  = "calitp-composer-dags/sync_kuba/METADATA.yml"
!~      md5hash             = "rYX57iU0NadWmDL/eY1oCg==" -> (known after apply)
        name                = "dags/sync_kuba/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_kuba/device_monitoring.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "a/JjaQ==" -> (known after apply)
!~      detect_md5hash      = "mz5R6E4lg2YhyH3MUlytOQ==" -> "different hash"
!~      generation          = 1752606164136346 -> (known after apply)
        id                  = "calitp-composer-dags/sync_kuba/device_monitoring.yml"
!~      md5hash             = "mz5R6E4lg2YhyH3MUlytOQ==" -> (known after apply)
        name                = "dags/sync_kuba/device_monitoring.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/kuba_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "JTC8rw==" -> (known after apply)
!~      detect_md5hash      = "i8NNRbEgt8nlVzklbCzVCg==" -> "different hash"
!~      generation          = 1755038574413327 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/kuba_to_gcs_operator.py"
!~      md5hash             = "i8NNRbEgt8nlVzklbCzVCg==" -> (known after apply)
        name                = "plugins/operators/kuba_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ZofoqQ==" -> (known after apply)
!~      detect_md5hash      = "VnE3wKeVgjHaIQwi/whD0g==" -> "different hash"
!~      generation          = 1758764038141917 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "VnE3wKeVgjHaIQwi/whD0g==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "byI+2A==" -> (known after apply)
!~      detect_md5hash      = "8aNFBYU2bQeHg78aUIUV7w==" -> "different hash"
!~      generation          = 1758764039901527 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "8aNFBYU2bQeHg78aUIUV7w==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #715](https://github.com/cal-itp/data-infra/actions/runs/18025057657)